{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "Localization System Tutorial"
			},
			"Translation":
			{
				"Text": "Localization System Tutorial"
			},
			"Key": "ProjectDisplayedTitle"
		},
		{
			"Source":
			{
				"Text": "Localization System Tutorial - Debug"
			},
			"Translation":
			{
				"Text": "Localization System Tutorial - Debug"
			},
			"Key": "ProjectDebugTitleInfo"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "Asset_Direct",
			"Children": [
				{
					"Source":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Translation":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Key": "textliteral_asset_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_1",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the first text literal created in code."
					},
					"Translation":
					{
						"Text": "This is the first text literal created in code."
					},
					"Key": "Cpp_TextLiteral_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_2",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the second text literal created in code."
					},
					"Translation":
					{
						"Text": "This is the second text literal created in code."
					},
					"Key": "Cpp_TextLiteral_2"
				}
			]
		},
		{
			"Namespace": "ST_Animals",
			"Children": [
				{
					"Source":
					{
						"Text": "cat"
					},
					"Translation":
					{
						"Text": "cat"
					},
					"Key": "st_cpp_animals_cat"
				},
				{
					"Source":
					{
						"Text": "dog"
					},
					"Translation":
					{
						"Text": "dog"
					},
					"Key": "st_cpp_animals_dog"
				}
			]
		},
		{
			"Namespace": "ST_Fruits",
			"Children": [
				{
					"Source":
					{
						"Text": "apple"
					},
					"Translation":
					{
						"Text": "apple"
					},
					"Key": "st_asset_fruits_apple"
				},
				{
					"Source":
					{
						"Text": "banana"
					},
					"Translation":
					{
						"Text": "banana"
					},
					"Key": "st_asset_fruits_banana"
				}
			]
		}
	]
}